FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd20g15.h
#define PINMUX_PB22F_TC7_WO0         ( ( PIN_PB22F_TC7_WO0 << 16 ) | MUX_PB22F_TC7_WO0 )
#define PORT_PB22F_TC7_WO0           ( 1u << 22 )
#define PIN_PA20E_TC7_WO0            20       /**< \brief TC7 signal: WO0 on PA20 mux E */
#define MUX_PA20E_TC7_WO0            4
#define PINMUX_PA20E_TC7_WO0         ( ( PIN_PA20E_TC7_WO0 << 16 ) | MUX_PA20E_TC7_WO0 )
#define PORT_PA20E_TC7_WO0           ( 1u << 20 )
#define PIN_PB23F_TC7_WO1            55       /**< \brief TC7 signal: WO1 on PB23 mux F */
#define MUX_PB23F_TC7_WO1            5
#define PINMUX_PB23F_TC7_WO1         ( ( PIN_PB23F_TC7_WO1 << 16 ) | MUX_PB23F_TC7_WO1 )
#define PORT_PB23F_TC7_WO1           ( 1u << 23 )
#define PIN_PA21E_TC7_WO1            21       /**< \brief TC7 signal: WO1 on PA21 mux E */
#define MUX_PA21E_TC7_WO1            4
#define PINMUX_PA21E_TC7_WO1         ( ( PIN_PA21E_TC7_WO1 << 16 ) | MUX_PA21E_TC7_WO1 )
#define PORT_PA21E_TC7_WO1           ( 1u << 21 )
/* ========== PORT definition for ADC peripheral ========== */
#define PIN_PA02B_ADC_AIN0           2        /**< \brief ADC signal: AIN0 on PA02 mux B */
#define MUX_PA02B_ADC_AIN0           1
#define PINMUX_PA02B_ADC_AIN0        ( ( PIN_PA02B_ADC_AIN0 << 16 ) | MUX_PA02B_ADC_AIN0 )
#define PORT_PA02B_ADC_AIN0          ( 1u << 2 )
#define PIN_PA03B_ADC_AIN1           3        /**< \brief ADC signal: AIN1 on PA03 mux B */
#define MUX_PA03B_ADC_AIN1           1
#define PINMUX_PA03B_ADC_AIN1        ( ( PIN_PA03B_ADC_AIN1 << 16 ) | MUX_PA03B_ADC_AIN1 )
#define PORT_PA03B_ADC_AIN1          ( 1u << 3 )
#define PIN_PB08B_ADC_AIN2           40       /**< \brief ADC signal: AIN2 on PB08 mux B */
#define MUX_PB08B_ADC_AIN2           1
#define PINMUX_PB08B_ADC_AIN2        ( ( PIN_PB08B_ADC_AIN2 << 16 ) | MUX_PB08B_ADC_AIN2 )
#define PORT_PB08B_ADC_AIN2          ( 1u << 8 )
#define PIN_PB09B_ADC_AIN3           41       /**< \brief ADC signal: AIN3 on PB09 mux B */
#define MUX_PB09B_ADC_AIN3           1
#define PINMUX_PB09B_ADC_AIN3        ( ( PIN_PB09B_ADC_AIN3 << 16 ) | MUX_PB09B_ADC_AIN3 )
#define PORT_PB09B_ADC_AIN3          ( 1u << 9 )
#define PIN_PA04B_ADC_AIN4           4        /**< \brief ADC signal: AIN4 on PA04 mux B */
#define MUX_PA04B_ADC_AIN4           1
#define PINMUX_PA04B_ADC_AIN4        ( ( PIN_PA04B_ADC_AIN4 << 16 ) | MUX_PA04B_ADC_AIN4 )
#define PORT_PA04B_ADC_AIN4          ( 1u << 4 )
#define PIN_PA05B_ADC_AIN5           5        /**< \brief ADC signal: AIN5 on PA05 mux B */
#define MUX_PA05B_ADC_AIN5           1
#define PINMUX_PA05B_ADC_AIN5        ( ( PIN_PA05B_ADC_AIN5 << 16 ) | MUX_PA05B_ADC_AIN5 )
#define PORT_PA05B_ADC_AIN5          ( 1u << 5 )
#define PIN_PA06B_ADC_AIN6           6        /**< \brief ADC signal: AIN6 on PA06 mux B */
#define MUX_PA06B_ADC_AIN6           1
#define PINMUX_PA06B_ADC_AIN6        ( ( PIN_PA06B_ADC_AIN6 << 16 ) | MUX_PA06B_ADC_AIN6 )
#define PORT_PA06B_ADC_AIN6          ( 1u << 6 )
#define PIN_PA07B_ADC_AIN7           7        /**< \brief ADC signal: AIN7 on PA07 mux B */
#define MUX_PA07B_ADC_AIN7           1
#define PINMUX_PA07B_ADC_AIN7        ( ( PIN_PA07B_ADC_AIN7 << 16 ) | MUX_PA07B_ADC_AIN7 )
#define PORT_PA07B_ADC_AIN7          ( 1u << 7 )
#define PIN_PB02B_ADC_AIN10          34       /**< \brief ADC signal: AIN10 on PB02 mux B */
#define MUX_PB02B_ADC_AIN10          1
#define PINMUX_PB02B_ADC_AIN10       ( ( PIN_PB02B_ADC_AIN10 << 16 ) | MUX_PB02B_ADC_AIN10 )
#define PORT_PB02B_ADC_AIN10         ( 1u << 2 )
#define PIN_PB03B_ADC_AIN11          35       /**< \brief ADC signal: AIN11 on PB03 mux B */
#define MUX_PB03B_ADC_AIN11          1
#define PINMUX_PB03B_ADC_AIN11       ( ( PIN_PB03B_ADC_AIN11 << 16 ) | MUX_PB03B_ADC_AIN11 )
#define PORT_PB03B_ADC_AIN11         ( 1u << 3 )
#define PIN_PA08B_ADC_AIN16          8        /**< \brief ADC signal: AIN16 on PA08 mux B */
#define MUX_PA08B_ADC_AIN16          1
#define PINMUX_PA08B_ADC_AIN16       ( ( PIN_PA08B_ADC_AIN16 << 16 ) | MUX_PA08B_ADC_AIN16 )
#define PORT_PA08B_ADC_AIN16         ( 1u << 8 )
#define PIN_PA09B_ADC_AIN17          9        /**< \brief ADC signal: AIN17 on PA09 mux B */
#define MUX_PA09B_ADC_AIN17          1
#define PINMUX_PA09B_ADC_AIN17       ( ( PIN_PA09B_ADC_AIN17 << 16 ) | MUX_PA09B_ADC_AIN17 )
#define PORT_PA09B_ADC_AIN17         ( 1u << 9 )
#define PIN_PA10B_ADC_AIN18          10       /**< \brief ADC signal: AIN18 on PA10 mux B */
#define MUX_PA10B_ADC_AIN18          1
#define PINMUX_PA10B_ADC_AIN18       ( ( PIN_PA10B_ADC_AIN18 << 16 ) | MUX_PA10B_ADC_AIN18 )
#define PORT_PA10B_ADC_AIN18         ( 1u << 10 )
#define PIN_PA11B_ADC_AIN19          11       /**< \brief ADC signal: AIN19 on PA11 mux B */
#define MUX_PA11B_ADC_AIN19          1
#define PINMUX_PA11B_ADC_AIN19       ( ( PIN_PA11B_ADC_AIN19 << 16 ) | MUX_PA11B_ADC_AIN19 )
#define PORT_PA11B_ADC_AIN19         ( 1u << 11 )
#define PIN_PA04B_ADC_VREFP          4        /**< \brief ADC signal: VREFP on PA04 mux B */
#define MUX_PA04B_ADC_VREFP          1
#define PINMUX_PA04B_ADC_VREFP       ( ( PIN_PA04B_ADC_VREFP << 16 ) | MUX_PA04B_ADC_VREFP )
#define PORT_PA04B_ADC_VREFP         ( 1u << 4 )
/* ========== PORT definition for AC peripheral ========== */
#define PIN_PA04B_AC_AIN0            4        /**< \brief AC signal: AIN0 on PA04 mux B */
#define MUX_PA04B_AC_AIN0            1
#define PINMUX_PA04B_AC_AIN0         ( ( PIN_PA04B_AC_AIN0 << 16 ) | MUX_PA04B_AC_AIN0 )
#define PORT_PA04B_AC_AIN0           ( 1u << 4 )
#define PIN_PA05B_AC_AIN1            5        /**< \brief AC signal: AIN1 on PA05 mux B */
#define MUX_PA05B_AC_AIN1            1
#define PINMUX_PA05B_AC_AIN1         ( ( PIN_PA05B_AC_AIN1 << 16 ) | MUX_PA05B_AC_AIN1 )
#define PORT_PA05B_AC_AIN1           ( 1u << 5 )
#define PIN_PA06B_AC_AIN2            6        /**< \brief AC signal: AIN2 on PA06 mux B */
#define MUX_PA06B_AC_AIN2            1
#define PINMUX_PA06B_AC_AIN2         ( ( PIN_PA06B_AC_AIN2 << 16 ) | MUX_PA06B_AC_AIN2 )
#define PORT_PA06B_AC_AIN2           ( 1u << 6 )
#define PIN_PA07B_AC_AIN3            7        /**< \brief AC signal: AIN3 on PA07 mux B */
#define MUX_PA07B_AC_AIN3            1
#define PINMUX_PA07B_AC_AIN3         ( ( PIN_PA07B_AC_AIN3 << 16 ) | MUX_PA07B_AC_AIN3 )
#define PORT_PA07B_AC_AIN3           ( 1u << 7 )
#define PIN_PA12H_AC_CMP0            12       /**< \brief AC signal: CMP0 on PA12 mux H */
#define MUX_PA12H_AC_CMP0            7
#define PINMUX_PA12H_AC_CMP0         ( ( PIN_PA12H_AC_CMP0 << 16 ) | MUX_PA12H_AC_CMP0 )
#define PORT_PA12H_AC_CMP0           ( 1u << 12 )
#define PIN_PA18H_AC_CMP0            18       /**< \brief AC signal: CMP0 on PA18 mux H */
#define MUX_PA18H_AC_CMP0            7
#define PINMUX_PA18H_AC_CMP0         ( ( PIN_PA18H_AC_CMP0 << 16 ) | MUX_PA18H_AC_CMP0 )
#define PORT_PA18H_AC_CMP0           ( 1u << 18 )
#define PIN_PA13H_AC_CMP1            13       /**< \brief AC signal: CMP1 on PA13 mux H */
#define MUX_PA13H_AC_CMP1            7
#define PINMUX_PA13H_AC_CMP1         ( ( PIN_PA13H_AC_CMP1 << 16 ) | MUX_PA13H_AC_CMP1 )
#define PORT_PA13H_AC_CMP1           ( 1u << 13 )
#define PIN_PA19H_AC_CMP1            19       /**< \brief AC signal: CMP1 on PA19 mux H */
#define MUX_PA19H_AC_CMP1            7
#define PINMUX_PA19H_AC_CMP1         ( ( PIN_PA19H_AC_CMP1 << 16 ) | MUX_PA19H_AC_CMP1 )
#define PORT_PA19H_AC_CMP1           ( 1u << 19 )
/* ========== PORT definition for DAC peripheral ========== */
#define PIN_PA02B_DAC_VOUT           2        /**< \brief DAC signal: VOUT on PA02 mux B */
#define MUX_PA02B_DAC_VOUT           1
#define PINMUX_PA02B_DAC_VOUT        ( ( PIN_PA02B_DAC_VOUT << 16 ) | MUX_PA02B_DAC_VOUT )
#define PORT_PA02B_DAC_VOUT          ( 1u << 2 )
#define PIN_PA03B_DAC_VREFP          3        /**< \brief DAC signal: VREFP on PA03 mux B */
#define MUX_PA03B_DAC_VREFP          1
#define PINMUX_PA03B_DAC_VREFP       ( ( PIN_PA03B_DAC_VREFP << 16 ) | MUX_PA03B_DAC_VREFP )
#define PORT_PA03B_DAC_VREFP         ( 1u << 3 )

#endif /* _SAMD20G15_PIO_ */
